#include <stdio.h>
#include <stdlib.h>

int minSteps(int x, int y) {
    // Якщо x дорівнює y, немає потреби виконувати жоден крок
    if (x == y) {
        return 0;
    }
    // Якщо різниця між x та y дорівнює 1 або 2, потрібен лише один крок
    else if (y - x == 1 || y - x == 2) {
        return 1;
    }

    int stepCount = 2; // Початкова кількість кроків
    int a = 1, b = 2, c = 3; // Початкові значення для послідовності Фібоначчі

    // Обчислення кількості кроків за допомогою ряду Фібоначчі
    while (c <= y - x) {
        a = b;
        b = c;
        c = a + b;
        stepCount++;
    }

    return stepCount;
}

int main() {
    int x, y;
    printf("Введіть значення x: "); // Попросити користувача ввести значення x
    scanf("%d", &x); // Зчитати значення x з введення користувача
    printf("Введіть значення y: "); // Попросити користувача ввести значення y
    scanf("%d", &y); // Зчитати значення y з введення користувача

    int result = minSteps(x, y);
    printf("Мінімальна кількість кроків: %d\n", result); // Вивести мінімальну кількість кроків

    return 0;
}
